buzzwang1/pcb/source/Driver/STM32/U5/HAL/cI2C/v01.01.01/cI2C.h
#ifndef __cI2C_H__
#define __cI2C_H__

#include "Typedef.h"
#include "stm32u5xx.h"
#include "stm32u5xx_hal.h"
#include "stm32u5xx_hal_i2c.h"
#include "stm32u5xx_ll_i2c.h"
#include "stm32u5xx_ll_dma.h"

#include "tGPPin.h"
#include "ComDat.h"
#include "ClockInfo.h"



class cI2c
{
  public:

  cGpPin *mPinSCL;
  cGpPin *mPinSDA;

  u8    mu8DmaCh;
  DMA_Channel_TypeDef* mstDmaCh;
  u32   mu32DmaRxTr1;
  u32   mu32DmaRxTr2;
  u32   mu32DmaRxPeriph;
  u32   mu32DmaTxTr1;
  u32   mu32DmaTxTr2;
  u32   mu32DmaTxPeriph;

  u32   mu32Baud;

  I2C_TypeDef   *mI2C;

  IRQn_Type mnNVIC_IRQChannelEv;
  IRQn_Type mnNVIC_IRQChannelEr;

  uint8 mui8Adr1;
  uint8 mui8Adr2;

  cI2c(I2C_TypeDef *lstI2c, cGpPin *lcScl, cGpPin *lcSda, u8 lu8DmaCh)
  {
    mI2C = lstI2c;

    mPinSCL = lcScl;
    mPinSDA = lcSda;

    mu8DmaCh = lu8DmaCh;
    mstDmaCh = ((DMA_Channel_TypeDef*)(GPDMA1_BASE + LL_DMA_CH_OFFSET_TAB[mu8DmaCh]));
  }

  // vAdrEnable und vAdrDisable sollte nicht während einer
  // laufenden Adressierung ausgeführt werden
  void vAdrEnable()  { LL_I2C_EnableOwnAddress1(mI2C); };
  void vAdrDisable() { LL_I2C_DisableOwnAddress1(mI2C); };
  bool isAdrEnabled() { return LL_I2C_IsEnabledOwnAddress1(mI2C); };

  void vActivateNack() { LL_I2C_AcknowledgeNextData(mI2C, LL_I2C_NACK); };

  void  vSetAdr2(u8 lui8Adr2)
  {
    //GPIOB->BSRR = (1 << 15);

    LL_I2C_DisableOwnAddress2(mI2C);
    if (lui8Adr2)
    {
      mui8Adr2 = lui8Adr2;
      LL_I2C_SetOwnAddress2(mI2C, mui8Adr2, 0);
      LL_I2C_EnableOwnAddress2(mI2C);
    }

    //GPIOB->BSRR = (1 << (16 + 15));
  }

  inline void vStopDMA()
  {
    mstDmaCh->CCR &= ~DMA_CCR_EN;
  }

  // Überprüft, ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas empfangen wurde
  u16 u16GetDmaCounterRx()
  {
    return (mstDmaCh->CBR1 & 0xFFFF);
  }

  // Überprüft, ob sich der DMA counter geändert hat. Um rauszufinden, ob irgendwas gesendet wurde
  u16 u16GetDmaCounterTx()
  {
    return (mstDmaCh->CBR1 & 0xFFFF);
  }


  void vStartDMATx(uint8* pBuffer, uint32 BufferSize)
  {
    mstDmaCh->CFCR = DMA_CFCR_TCF;
    mstDmaCh->CCR &= ~DMA_CCR_EN;
    mstDmaCh->CBR1 = BufferSize;
    mstDmaCh->CSAR = (uint32)pBuffer;
    mstDmaCh->CDAR = mu32DmaTxPeriph;
    mstDmaCh->CTR1 = mu32DmaTxTr1;
    mstDmaCh->CTR2 = mu32DmaTxTr2;
    mstDmaCh->CCR |= DMA_CCR_EN;
  }

  void vFlushRx()
  {
    // In case there is still something in the RX Register
    // Flush RXDR, else DMA will have offset
    if (mI2C->ISR & I2C_ISR_RXNE)
    {
      volatile u8 lu8Dummy = mI2C->RXDR;
      UNUSED(lu8Dummy);
    }
  }

  void vStartDMARx(uint8* pBuffer, uint32 BufferSize)
  {
    vFlushRx();

    mstDmaCh->CFCR = DMA_CFCR_TCF;
    mstDmaCh->CCR &= ~DMA_CCR_EN;
    mstDmaCh->CBR1 = BufferSize;
    mstDmaCh->CSAR = mu32DmaRxPeriph;
    mstDmaCh->CDAR = (uint32)pBuffer;
    mstDmaCh->CTR1 = mu32DmaRxTr1;
    mstDmaCh->CTR2 = mu32DmaRxTr2;
    mstDmaCh->CCR |= DMA_CCR_EN;
  }

  void  vClearClockLine()
  {
    mPinSCL->vSetMode(GPIO_MODE_OUTPUT_OD);

    //for (u8 lu8t = 0; lu8t < 9; lu8t++)
    {
      cClockInfo::Delay_us(1);
      mPinSCL->vSet0();
      cClockInfo::Delay_us(1);
      mPinSCL->vSet1();
    }

    // Es is immer AF4 egal ob I2C1, I2C2, I2C3, oder I2C4
    mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);
  }

  u32 u32BaudToRegister()
  {
    // Prepared
    //  - I2C Clock = 16Mhz HSI
    //  - Digital Filter DNF = 2
    //  - Analog Filter on.
    //  - Used CubeI2CTool
    //     - Rise Time = 0
    //     - Fall Time = 0
    //        - Baud =  20.000 => 0x10108EFB
    //        - Baud =  40.000 => 0x10103D84
    //        - Baud =  50.000 => 0x00303BF9
    //        - Baud = 100.000 => 0x2010131D
    //        - Baud = 200.000 => 0x00303BF9
    //        - Baud = 300.000 => 0x00100525
    //        - Baud = 400.000 => 0x00100418
    //
    //
    if (mu32Baud <=  20000) return 0x10108EFB;
    if (mu32Baud <=  40000) return 0x10103D84;
    if (mu32Baud <=  50000) return 0x00303BF9;
    if (mu32Baud <= 100000)  return 0x2010131D;
    if (mu32Baud <= 200000)  return 0x00303BF9;
    if (mu32Baud <= 300000)  return 0x00100525;
    /*if (mu32Baud <= 400000)*/  return 0x00100418;
  }

  u8 isErrorActive()
  {
    uint32 lui32ErrorMask;
    lui32ErrorMask = I2C_ISR_NACKF | I2C_ISR_BERR | I2C_ISR_ARLO | I2C_ISR_OVR | I2C_ISR_PECERR | I2C_ISR_TIMEOUT | I2C_ISR_ALERT;
    if ((mI2C->ISR & lui32ErrorMask)) return 1;
    return 0;
  }

  void vInitDma()
  {
    /* Enable DMA clock */
    __HAL_RCC_GPDMA1_CLK_ENABLE();

    /* DMA node configuration declaration */
    LL_DMA_InitTypeDef           lstDmaInit;

    LL_DMA_StructInit(&lstDmaInit);

    lstDmaInit.BlkHWRequest  = LL_DMA_HWREQUEST_SINGLEBURST;
    lstDmaInit.DataAlignment = LL_DMA_DATA_ALIGN_ZEROPADD;

    lstDmaInit.SrcBurstLength  = 1;
    lstDmaInit.DestBurstLength = 1;

    lstDmaInit.SrcDataWidth  = LL_DMA_SRC_DATAWIDTH_BYTE;
    lstDmaInit.DestDataWidth = LL_DMA_DEST_DATAWIDTH_BYTE;


    lstDmaInit.Priority = LL_DMA_LOW_PRIORITY_LOW_WEIGHT;
    lstDmaInit.BlkDataLength = 0;

    lstDmaInit.TransferEventMode = LL_DMA_TCEM_BLK_TRANSFER;


    // -Port 0 should be allocated for transfers toand from
    //  peripherals, because there is a direct hardware datapath
    //  between this portand the APB peripherals, outside the  AHB matrix
    // -Port 1 should be allocated for transfers toand from
    //  memory, which are performed through the AHB interconnect.

    if (mI2C == I2C1) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C1_RX;
    if (mI2C == I2C2) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C2_RX;
    if (mI2C == I2C3) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C3_RX;
    if (mI2C == I2C4) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C4_RX;
    lstDmaInit.SrcAddress  = LL_I2C_DMA_GetRegAddr(mI2C, LL_I2C_DMA_REG_DATA_RECEIVE);
    lstDmaInit.DestAddress = 0;
    lstDmaInit.SrcIncMode  = LL_DMA_SRC_FIXED;
    lstDmaInit.DestIncMode = LL_DMA_DEST_INCREMENT;
    lstDmaInit.Direction   = LL_DMA_DIRECTION_PERIPH_TO_MEMORY;
    lstDmaInit.SrcAllocatedPort  = LL_DMA_DEST_ALLOCATED_PORT0; // Source is periph
    lstDmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT1; // Dest is memory
    LL_DMA_Init(GPDMA1, mu8DmaCh, &lstDmaInit);

    mu32DmaRxTr1    = mstDmaCh->CTR1;
    mu32DmaRxTr2    = mstDmaCh->CTR2;
    mu32DmaRxPeriph = mstDmaCh->CSAR;

