buzzwang1/pcb/source/Driver/STM32/U5/HAL/cI2C/v01.01.01/cI2C.h
    if (mI2C == I2C1) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C1_TX;
    if (mI2C == I2C2) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C2_TX;
    if (mI2C == I2C3) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C3_TX;
    if (mI2C == I2C4) lstDmaInit.Request = LL_GPDMA1_REQUEST_I2C4_TX;
    lstDmaInit.SrcAddress  = 0;
    lstDmaInit.DestAddress = LL_I2C_DMA_GetRegAddr(mI2C, LL_I2C_DMA_REG_DATA_TRANSMIT);
    lstDmaInit.SrcIncMode  = LL_DMA_SRC_INCREMENT;
    lstDmaInit.DestIncMode = LL_DMA_DEST_FIXED;
    lstDmaInit.Direction   = LL_DMA_DIRECTION_MEMORY_TO_PERIPH;
    lstDmaInit.SrcAllocatedPort  = LL_DMA_DEST_ALLOCATED_PORT1; // Source is memory
    lstDmaInit.DestAllocatedPort = LL_DMA_DEST_ALLOCATED_PORT0; // Dest is periph
    LL_DMA_Init(GPDMA1, mu8DmaCh, &lstDmaInit);

    mu32DmaTxTr1    = mstDmaCh->CTR1;
    mu32DmaTxTr2    = mstDmaCh->CTR2;
    mu32DmaTxPeriph = mstDmaCh->CDAR;
  }
  cComNode::tenError enInitHw(bool lbMaster) // __attribute__((optimize("-O0")))
  {
    I2C_HandleTypeDef lhI2c = {};

    if (mI2C == I2C1) __HAL_RCC_I2C1_CLK_DISABLE();
    if (mI2C == I2C2) __HAL_RCC_I2C2_CLK_DISABLE();
    if (mI2C == I2C3) __HAL_RCC_I2C3_CLK_DISABLE();
    if (mI2C == I2C4) __HAL_RCC_I2C4_CLK_DISABLE();

    vStopDMA();

    //SDA and SCL must be pulled high
    if (lbMaster)
    {
      if (!bCheckPins()) vClearClockLine();
      if (!bCheckPins()) return cComNode::enErDeviceInitErrorPins;
    }

    // Es is immer AF4 egal ob I2C1, I2C2, oder I2C3
    mPinSCL->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);
    mPinSDA->vSetAF(GPIO_MODE_AF_OD, GPIO_AF4_I2C1);


    /* I2C Periph clock enable */
    if (mI2C == I2C1) { __HAL_RCC_I2C1_CLK_ENABLE(); __HAL_RCC_I2C1_CONFIG(RCC_I2C1CLKSOURCE_HSI); } // 16Mhz
    if (mI2C == I2C2) { __HAL_RCC_I2C2_CLK_ENABLE(); __HAL_RCC_I2C2_CONFIG(RCC_I2C2CLKSOURCE_HSI); } // 16Mhz
    if (mI2C == I2C3) { __HAL_RCC_I2C3_CLK_ENABLE(); __HAL_RCC_I2C3_CONFIG(RCC_I2C3CLKSOURCE_HSI); } // 16Mhz
    if (mI2C == I2C4) { __HAL_RCC_I2C4_CLK_ENABLE(); __HAL_RCC_I2C4_CONFIG(RCC_I2C4CLKSOURCE_HSI); } // 16Mhz

    /* I2C Peripheral Disable */
    LL_I2C_Disable(mI2C);


    /* I2C configuration */
    /* I2C configuration */
    lhI2c.Instance = mI2C;
    lhI2c.Init.Timing          = u32BaudToRegister();
    lhI2c.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLED;
    lhI2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLED;
    lhI2c.Init.AddressingMode  = I2C_ADDRESSINGMODE_7BIT;
    lhI2c.Init.OwnAddress1     = mui8Adr1 << 1;
    lhI2c.Init.DualAddressMode = I2C_DUALADDRESS_DISABLE;
    lhI2c.Init.OwnAddress2     = mui8Adr2;
    lhI2c.Init.GeneralCallMode = I2C_GENERALCALL_DISABLE;
    lhI2c.Init.NoStretchMode   = I2C_NOSTRETCH_DISABLE;


    /* Peripheral clock enable */
    HAL_I2C_Init(&lhI2c);
    HAL_I2CEx_AnalogFilter_Config(&lhI2c, I2C_ANALOGFILTER_ENABLED);
    HAL_I2CEx_DigitalFilter_Config(&lhI2c, 2); // These bits are used to configure the digital noise filter on SDA and SCL input. The digital
                                               // filter, filters spikes with a length of up to DNF[3:0] * t I2CCLK

    if (!lbMaster)
    {
      vSetAdr2(mui8Adr2);
    }

    mI2C->ICR = 0xFFFF;

    LL_I2C_EnableDMAReq_RX(mI2C);
    LL_I2C_EnableDMAReq_TX(mI2C);

    if (isErrorActive())
    {
      return cComNode::enErDeviceInitErrorDevice;
    }

    if (mI2C->ISR & I2C_ISR_BUSY)
    {
      return cComNode::enErDeviceInitErrorBusy;
    }

    if (mI2C == I2C1) mnNVIC_IRQChannelEv = I2C1_EV_IRQn;
    if (mI2C == I2C2) mnNVIC_IRQChannelEv = I2C2_EV_IRQn;
    if (mI2C == I2C3) mnNVIC_IRQChannelEv = I2C3_EV_IRQn;
	  if (mI2C == I2C4) mnNVIC_IRQChannelEv = I2C4_EV_IRQn;
    /* Set the TIMx priority */
    HAL_NVIC_SetPriority(mnNVIC_IRQChannelEv, 8, 8);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEv);


    if (mI2C == I2C1) mnNVIC_IRQChannelEr = I2C1_ER_IRQn;
    if (mI2C == I2C2) mnNVIC_IRQChannelEr = I2C2_ER_IRQn;
    if (mI2C == I2C3) mnNVIC_IRQChannelEr = I2C3_ER_IRQn;
    if (mI2C == I2C4) mnNVIC_IRQChannelEr = I2C4_ER_IRQn;
    /* Set the TIMx priority */
    HAL_NVIC_SetPriority(mnNVIC_IRQChannelEr, 8, 8);
    /* Enable the TIMx global Interrupt */
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEr);

    if (lbMaster)
    {
      mI2C->CR1 |= I2C_CR1_ERRIE | I2C_CR1_TCIE | I2C_CR1_STOPIE | I2C_CR1_NACKIE;
    }
    else
    {
      mI2C->CR1 |= I2C_CR1_ERRIE | I2C_CR1_STOPIE | I2C_CR1_ADDRIE;
    }

    vInitDma();

    return cComNode::enNoError;
  }

  void vEnableIrq()
  {
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEv);
    HAL_NVIC_EnableIRQ(mnNVIC_IRQChannelEr);
  }

  void vDisableIrq()
  {
    HAL_NVIC_DisableIRQ(mnNVIC_IRQChannelEv);
    HAL_NVIC_DisableIRQ(mnNVIC_IRQChannelEr);
  }

  void vWaitUntilStop()
  {
    u16 lu8Timeout = 100;
    while ((lu8Timeout) && (!(mI2C->ISR & I2C_ISR_STOPF))) // stop
    {
      lu8Timeout--;
    }
  }

  void vWaitWhileBusy()
  {
    u16 lu8Timeout = 100;
    while ((lu8Timeout) && (mI2C->ISR & I2C_ISR_BUSY))
    {
      lu8Timeout--;
    }
  }

  bool bCheckBusy()
  {
    return (!(mI2C->ISR & I2C_ISR_BUSY));
  }

  bool bCheckPins()
  {
    mPinSCL->vSetMode(GPIO_MODE_INPUT);
    mPinSDA->vSetMode(GPIO_MODE_INPUT);

    //SDA and SCL must be pulled high
    if ((mPinSCL->ui8Get() == 0) || (mPinSDA->ui8Get() == 0))
    {
      return False;
    }
    return True;
  }

  void vClearSTOPandNACK()
  {
    mI2C->ICR = I2C_ICR_STOPCF | I2C_ICR_NACKCF; //Clear Stop and Nack detection flag
  }
};


class cI2cMaster : public cI2c, public cComNodeMasterMulti
{
  public:

  // Für Nachrichten >255 Byte
  uint8               *mpui8ComBuf;
  uint32               mui32ComByteCnt;

  cI2cMaster(I2C_TypeDef *lstI2c, cGpPin *lcScl, cGpPin *lcSda, u8 lu8DmaCh,
             u32 lu32Baud = 400000, u16 luInitDelay_ms = 1)
    : cI2c(lstI2c, lcScl, lcSda, lu8DmaCh),
      cComNodeMasterMulti(luInitDelay_ms)
  {
    mu32Baud     = lu32Baud;
    mu32Baudrate = lu32Baud;
    mui8Adr1     = mui8Adr2 = 0;
  }

  cComNode::tenError enInitHw() override
  {
    return cI2c::enInitHw(True);
  }

  bool bCheckBusy() override
  {
    return cI2c::bCheckBusy();
  }

