buzzwang1/pcb/source/Driver/STM32/U5/HAL/cI2C/v01.01.01/cI2C.h
  /*
    RXNE:   Receive buffer not empty
    TXIS:   Transmit buffer interrupt status
    STOPF:  Stop detection interrupt flag
    TC/TCR: Transfer Complete/ Transfer complete Reload
    ADDR:   Address matched
    NACKF:  NACK reception
  */
  void I2C_EV_IRQHandler()
  {
    if (mI2C->ISR & I2C_ISR_NACKF)
    {
      vComError();
    }
    else
    {
      vSm(cComNode::tenEvent::enEvIrq);
    }
    vStart();
  }

  /*
    BERR:    Bus error
    ARLO:    Arbitration loss
    OVR:     Overrun/Underrun
    PECERR:  PEC error
    TIMEOUT: Timeout/tLOW error
    ALERT:   SMBus Alert
    Note: NACK is not an ER. It is a EV
  */
  void I2C_ER_IRQHandler()
  {
    vErrorHdl();
  }


  void vResetCom()
  {
    if (mSm != cComNode::tenState::enStIdle)
    {
      // I2C Peripheral Disable
      vStopDMA();
      mI2C->ICR = 0xFFFF;
      mpcActiveMsg   = NULL;
      mpcActiveSlave = NULL;

      mSm    = cComNode::tenState::enStIdle;
      mError = cComNode::enNoError;
    }
  }

  /*
    I2Cx_ISR->NACKF: Not Acknowledge received flag: It is cleared by software by setting the OVRCF bit.:  This bit is cleared by hardware when PE=0
    I2Cx_ISR->BERR:  Bus error:                     It is cleared by software by setting BERRCF bit.:     This bit is cleared by hardware when PE=0.
    I2Cx_ISR->OVR:   Overrun/Underrun (slave mode): It is cleared by software by setting the OVRCF bit.:  This bit is cleared by hardware when PE=0.
    I2Cx_ISR->ARLO:  Arbitration lost:              It is cleared by software by setting the ARLOCF bit.: This bit is cleared by hardware when PE=0.
  */
  void vComError() override
  {
    u32 lui32ErrorMask;
    lui32ErrorMask = I2C_ISR_BUSY | I2C_ISR_NACKF | I2C_ISR_BERR | I2C_ISR_ARLO | I2C_ISR_OVR | I2C_ISR_PECERR | I2C_ISR_TIMEOUT | I2C_ISR_ALERT;

    if (mI2C->ISR & lui32ErrorMask)
    {
      if      (mI2C->ISR & I2C_ISR_NACKF) mError = cComNode::enErNACK;
      else if (mI2C->ISR & I2C_ISR_BERR)  mError = cComNode::enErBusError;
      else if (mI2C->ISR & I2C_ISR_ARLO)  mError = cComNode::enErArbitrationLost;
      else if (mI2C->ISR & I2C_ISR_OVR)   mError = cComNode::enErOverrun;
      else if (mI2C->ISR & I2C_ISR_BUSY)  mError = cComNode::enErStartWhileBusy;

      // Über das Interface kann isNoErrorHandling gesetzt werden, um die Fehlerbehandlung zu unterdrücken
      // Das wird z.B. benutzt wenn nach Nack nochmals wiederhohlt werden soll.
      if (mI2C->ISR & I2C_ISR_NACKF)
      {
        // If a NACK is received : the TXIS flag is not set, and a STOP condition is automatically
        //   sent after the NACK reception.the NACKF flag is set in the I2C_ISR register, and an
        //   interrupt is generated if the NACKIE bit is set.
        //
        // Bei NACK wird von der HW die Stop Sequenz gestarted
        // Warten bis diese fertig ist ist.
        vWaitUntilStop();
        vClearSTOPandNACK();
      }
    }

    if (mpcActiveSlave != NULL)
    {
      if (mpcActiveMsg  != NULL)
      {
        u16 luMsgLen;
        switch (mpcActiveMsg->enDir())
        {
          case cComNode::tenDirection::enIsTxRx:
            luMsgLen = ((cComMsgI2c<u16>*)mpcActiveMsg)->GetLenTx();
            break;
          default:
            luMsgLen = mpcActiveMsg->Len();
            break;
        }
        if (cI2c::u16GetDmaCounterTx() == luMsgLen)
        {
          // Es wurden keine Daten gesendet, d.h. NACK während der Adressierung
          mpcActiveSlave->vComError(mError, cComNode::tenState::enStAdress);
        }
        else
        {
          mpcActiveSlave->vComError(mError, mSm);
        }
      }
      else
      {
        mpcActiveSlave->vComError(mError, mSm);
      }

    }
    vResetCom();
  }

  void vSm(cComNode::tenEvent lenEvent)  // __attribute__((optimize("-O0")))
  {
    uint8 lui8SlaveAdr;

    lui8SlaveAdr = mpcActiveSlave->mAdr;

    switch (mSm)
    {
      case cComNode::tenState::enStIdle:
      case cComNode::tenState::enStIdle2:
      case cComNode::tenState::enStLock:
      case cComNode::tenState::enStError:
        switch (lenEvent)
        {
          case cComNode::tenEvent::enEvStart:
          case cComNode::tenEvent::enEvStartSkipAdr:
            mI2C->ICR = 0xFFFF;
            switch (mpcActiveMsg->enDir())
            {
              case cComNode::tenDirection::enIsTxRx:
                mui32ComByteCnt = ((cComMsgI2c<u16>*)mpcActiveMsg)->GetLenTx();
                mpui8ComBuf     = ((cComMsgI2c<u16>*)mpcActiveMsg)->GetDataTx();
                break;
              default:
                mui32ComByteCnt = mpcActiveMsg->Len();
                mpui8ComBuf     = mpcActiveMsg->Data();
                break;
            }

            switch (mpcActiveMsg->enDir())
            {
              case cComNode::tenDirection::enIsTxRx:
                mSm = cComNode::tenState::enStTx;
                vStartDMATx(mpui8ComBuf, mui32ComByteCnt);
                LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, mui32ComByteCnt, LL_I2C_MODE_SOFTEND, LL_I2C_GENERATE_START_WRITE);
                break;
              case cComNode::tenDirection::enIsTx:
                mSm = cComNode::tenState::enStTx;
                vStartDMATx(mpui8ComBuf, mui32ComByteCnt);
                if (mui32ComByteCnt > 255)
                {
                  LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, 255, LL_I2C_MODE_RELOAD, LL_I2C_GENERATE_START_WRITE);
                }
                else
                {
                  LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, mui32ComByteCnt, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_WRITE);
                }
                break;
              case cComNode::tenDirection::enIsRx:
                mSm = cComNode::tenState::enStRx;
                vStartDMARx(mpui8ComBuf, mui32ComByteCnt);
                LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, mui32ComByteCnt, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_READ);
                break;
              default:
                mpcActiveSlave->vComDone();
                break;
            }
            break;
          case cComNode::tenEvent::enEvIrq:
              mError = cComNode::enErUnknown;
              vComError();
              mI2C->ICR = 0xFFFF;
            break;
          default:
            mI2C->ICR = 0xFFFF;
            break;
            break;
        }
        break;
      case cComNode::tenState::enStTx:
        {
          uint32 lui32ISR = mI2C->ISR;
          switch (lenEvent)
          {
            case cComNode::tenEvent::enEvIrq:
              if (lui32ISR & I2C_ISR_STOPF)
              {
                /* Clear STOPF flag */
                mI2C->ICR = I2C_ICR_STOPCF;
                mSm = cComNode::tenState::enStIdle;
                mpcActiveSlave->vComDone();
              }
              else if (lui32ISR & I2C_ISR_TCR)
              {
                mui32ComByteCnt -=255;
                mpui8ComBuf     +=255;
                if (mui32ComByteCnt>255)
                {
                  LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, 255, LL_I2C_MODE_RELOAD, LL_I2C_GENERATE_NOSTARTSTOP);
                }
                else
                {
                  uint32 lTmpreg;
                  lTmpreg = mI2C->CR2;
                  lTmpreg &= (uint32)~((uint32_t)(I2C_CR2_NBYTES | I2C_CR2_RELOAD | I2C_CR2_AUTOEND | I2C_CR2_RD_WRN | I2C_CR2_START | I2C_CR2_STOP));
                  lTmpreg |= (uint32)mui32ComByteCnt << 16;
                  if (mpcActiveMsg->isTx())
                  {
                    lTmpreg |= I2C_CR2_AUTOEND;
                  }
                  mI2C->CR2 = lTmpreg;
                  mui32ComByteCnt = 0;
                }
              }
              else if (lui32ISR & I2C_ISR_TC)
              {
                switch (mpcActiveMsg->enDir())
                {
                  case cComNode::tenDirection::enIsTxRx:
                    mSm = cComNode::enStRx;
                    mui32ComByteCnt = ((cComMsgI2c<u16>*)mpcActiveMsg)->GetLenRx();
                    mpui8ComBuf     = ((cComMsgI2c<u16>*)mpcActiveMsg)->GetDataRx();
                    vStartDMARx(mpui8ComBuf, mui32ComByteCnt);
                    LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, mui32ComByteCnt, LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_READ);
                    break;
                  case cComNode::tenDirection::enIsRx:
                    mSm = cComNode::enStRx;
                    vStartDMARx(mpcActiveMsg->mpu8Data, mpcActiveMsg->Len());
                    LL_I2C_HandleTransfer(mI2C, lui8SlaveAdr, LL_I2C_ADDRSLAVE_7BIT, mpcActiveMsg->Len(), LL_I2C_MODE_AUTOEND, LL_I2C_GENERATE_START_READ);
                    break;
                  default:
                    mSm = cComNode::tenState::enStIdle;
                    mpcActiveSlave->vComDone();
                    break;
                }
              }
              else
              {
                mError = cComNode::enErUnknown;
                vComError();
              }
              break;
            default:
              break;
          }
        }
        break;

      case cComNode::tenState::enStRx:
        switch (lenEvent)
        {
          case cComNode::tenEvent::enEvIrq:
            if (mI2C->ISR & (I2C_ISR_STOPF | I2C_ISR_TC))
            {
              /* Clear STOPF flag */
              mI2C->ICR = I2C_ICR_STOPCF;
              mSm = cComNode::tenState::enStIdle;
              mpcActiveSlave->vComDone();
            }
            else
            {
              vComError();
            }
            break;
          default:
            break;
        }
        break;
      default:
        break;
    }
  }
};



class cI2cSlave : public cI2c, public cComNodeSlave
{
  public:


  cI2cSlave(I2C_TypeDef *lstI2c, cGpPin *lcScl, cGpPin *lcSda, u8 lu8DmaCh,  uint8 lui8Adr1, uint8 lui8Adr2, u32 lu32Baud = 400000, u16 luInitDelay_ms = 1)
  : cI2c(lstI2c, lcScl, lcSda, lu8DmaCh),
    cComNodeSlave(luInitDelay_ms)
  {
    mI2C       = lstI2c;

